In [ ]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn

In [5]:
np.random.seed(0)

In [6]:
df=pd.DataFrame(randn(2,2),[0,1],[2,3])

In [7]:
df

          2         3
0  1.764052  0.400157
1  0.978738  2.240893

In [9]:
df[2]

0    1.764052
1    0.978738
Name: 2, dtype: float64

In [10]:
type(df[2])

pandas.core.series.Series

In [11]:
type(df)

pandas.core.frame.DataFrame

In [13]:
pd.Series([1,2],[3,4])

3    1
4    2
dtype: int64

In [14]:
df[[2,3]]

          2         3
0  1.764052  0.400157
1  0.978738  2.240893

In [15]:
df

          2         3
0  1.764052  0.400157
1  0.978738  2.240893

In [16]:
df[4]=df[2]+df[3]

In [17]:
df

          2         3         4
0  1.764052  0.400157  2.164210
1  0.978738  2.240893  3.219631

In [20]:
df.drop(4,axis=1)

          2         3
0  1.764052  0.400157
1  0.978738  2.240893

In [21]:
df

          2         3         4
0  1.764052  0.400157  2.164210
1  0.978738  2.240893  3.219631

In [22]:
df.drop(4,axis=1,inplace=True)

In [23]:
df

          2         3
0  1.764052  0.400157
1  0.978738  2.240893

In [24]:
df.drop(0)

          2         3
1  0.978738  2.240893

In [25]:
df

          2         3
0  1.764052  0.400157
1  0.978738  2.240893

In [26]:
df.shape

(2, 2)

In [31]:
df.loc[0]

2    1.764052
3    0.400157
Name: 0, dtype: float64

In [28]:
df.iloc[0]

2    1.764052
3    0.400157
Name: 0, dtype: float64

In [32]:
df=pd.DataFrame(randn(2,2),['0','1'],[2,3])

In [33]:
df

          2         3
0  1.867558 -0.977278
1  0.950088 -0.151357

In [34]:
df.loc['0']

2    1.867558
3   -0.977278
Name: 0, dtype: float64

In [35]:
df.iloc[0]

2    1.867558
3   -0.977278
Name: 0, dtype: float64

In [36]:
df.loc[['0','1'],[3]]

          3
0 -0.977278
1 -0.151357

In [78]:
df=pd.DataFrame([[1,2],[3,4]],[0,1],[0,1])

In [53]:
df/10

     0    1
0  0.1  0.2
1  0.3  0.4

In [54]:
df>0

      0     1
0  True  True
1  True  True

In [55]:
df[df>0]

   0  1
0  1  2
1  3  4

In [56]:
df[0]>2

0    False
1     True
Name: 0, dtype: bool

In [64]:
df[df[0]>2][[0,1]]

   0  1
1  3  4

In [67]:
df[(df[0]>0)&(df[1]<2)]

Empty DataFrame
Columns: [0, 1]
Index: []

In [68]:
df[(df[0]>0)|(df[1]<2)]

   0  1
0  1  2
1  3  4

In [79]:
df.reset_index()

   index  0  1
0      0  1  2
1      1  3  4

In [80]:
df

   0  1
0  1  2
1  3  4

In [81]:
a='a b'.split()

In [82]:
a

['a', 'b']

In [83]:
df['a']=a

In [84]:
df

   0  1  a
0  1  2  a
1  3  4  b

In [85]:
df.set_index('a')

   0  1
a
a  1  2
b  3  4

In [88]:
df.reset_index(inplace=False)

   index  0  1  a
0      0  1  2  a
1      1  3  4  b

In [104]:
a=['a','a','a','b','b','b']

In [105]:
b=[1,2,3,1,2,3]

In [106]:
c=list(zip(a,b))

In [107]:
c

[('a', 1), ('a', 2), ('a', 3), ('b', 1), ('b', 2), ('b', 3)]

In [108]:
c=pd.MultiIndex.from_tuples(c)

In [109]:
c

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3)],
           )

In [110]:
df=pd.DataFrame(randn(6,2),c,['a','b'])

In [111]:
df

            a         b
a 1 -0.887786 -1.980796
  2 -0.347912  0.156349
  3  1.230291  1.202380
b 1 -0.387327 -0.302303
  2 -1.048553 -1.420018
  3 -1.706270  1.950775

In [112]:
df.loc['a']

          a         b
1 -0.887786 -1.980796
2 -0.347912  0.156349
3  1.230291  1.202380

In [114]:
df.loc['a'].iloc[1]

a   -0.347912
b    0.156349
Name: 2, dtype: float64

In [116]:
df.index.names=['G','N']

In [117]:
df

            a         b
G N
a 1 -0.887786 -1.980796
  2 -0.347912  0.156349
  3  1.230291  1.202380
b 1 -0.387327 -0.302303
  2 -1.048553 -1.420018
  3 -1.706270  1.950775

In [118]:
df.loc['b'].loc[2]['b']

-1.4200179371789752

In [119]:
df.xs

<bound method NDFrame.xs of             a         b
G N
a 1 -0.887786 -1.980796
  2 -0.347912  0.156349
  3  1.230291  1.202380
b 1 -0.387327 -0.302303
  2 -1.048553 -1.420018
  3 -1.706270  1.950775>

In [120]:
df.xs('a')

          a         b
N
1 -0.887786 -1.980796
2 -0.347912  0.156349
3  1.230291  1.202380

In [121]:
df.xs(1,level='N')

          a         b
G
a -0.887786 -1.980796
b -0.387327 -0.302303